---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSpanhookPrim
source: html/e3aa808c-19f3-9ea9-f630-67897d58f6c1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSpanhookPrim Property

"Start Hook Angle Primary"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSpanhookPrim { get; }
```